FAQ_DATA = {
    "final": {
        "title": "🏆 Финал олимпиады",
        "questions": {
            "q1": {"question": "Когда приезжать?", "answer": ""},
            "q2": {"question": "Где регистрация?", "answer": ""},
            "q3": {"question": "Какое расписание?", "answer": ""},
            "q4": {"question": "Что взять с собой?", "answer": ""},
            "q5": {"question": "Правила поведения?", "answer": ""}
        }
    },
    "disciplines": {
        "title": "📚 Дисциплины и соревнования", 
        "questions": {
            "q1": {"question": "Как узнать свою дисциплину?", "answer": ""},
            "q2": {"question": "Где проходят соревнования?", "answer": ""},
            "q3": {"question": "Как устроена проверка?", "answer": ""}
        }
    },
    "location": {
        "title": "📍 Локация и логистика",
        "questions": {
            "q1": {"question": "Как доехать до УлГТУ?", "answer": ""},
            "q2": {"question": "Где ближайшие гостиницы?", "answer": ""},
            "q3": {"question": "Карта кампуса УлГТУ?", "answer": ""}
        }
    },
    "org": {
        "title": "📋 Орг. вопросы",
        "questions": {
            "q1": {"question": "Контакты организаторов", "answer": ""},
            "q2": {"question": "Где получить бейдж?", "answer": ""},
            "q3": {"question": "Где найти волонтёра?", "answer": ""}
        }
    }
}