# data/navigation_data.py

# Координаты Точки кипения УлГТУ
ULSTU_COORDS = "54.348705,48.385309" 
# Названия ключевых точек
LOCATIONS = {
    "main_building": {"name": "Точка кипения УлГТУ", "coords": "54.348705,48.385309"},
    "dormitory": {"name": "Общежитие", "coords": "54.352040,48.383748"},
    "dining": {"name": "Столовая", "coords": "54.352687,48.385106"},
    "corpus_a": {"name": "Корпус 2", "coords": "54.348706,48.385191"},
    "corpus_b": {"name": "Главный корпус УлГТУ", "coords": "54.351294,48.389750"},
    "train_station": {"name": "Ж/д вокзал", "coords": "54.271751,48.321905"},
    "bus_station": {"name": "Автовокзал", "coords": "54.303566,48.347212"}
}